БухЭксп/Documents/CW_ПроектыДТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_ПроектыДТ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.CW_ДТГрузоперевозок</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Импортер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Груз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГТД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроектПоЗаказу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_СтатусыПроектовДТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аналитика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойРасчетДТ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_РасчетыДТ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Грузоперевозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодТНВЭД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Грузоперевозка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/Catalogs/CW_Заказы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_Заказы</Name>
			<Comment>Заказы</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.CW_Заявки</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСделкиФ</Name>
					<Comment>Дата сделки (фактическая)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Comment>Клиент</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперативныйМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Груз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МаршрутыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийБюджета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коносамент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Коносаменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтрагентыПоБюджету</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыЗаказа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыПараметровЗаказа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВедущего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторыВедомых</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Раскрывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторГруппы</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Documents/CW_ПроектыДТ/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	ПраваДоступаНаСервере();
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Объект.Грузоперевозки.Очистить();
		ТаблицаГрузоперевозок.Очистить();
		ТаблицаРаспределенияТоваров.Очистить();
		ТаблицаРаспределено.Очистить();
		Объект.Аналитика        = Неопределено;
		Объект.ОсновнойРасчетДТ = Неопределено;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.Аналитика) Тогда
		ВариантПривязки = ?(Объект.ПроектПоЗаказу,0,1);
	Иначе
		ВариантПривязки = 2;
	КонецЕсли; 
	
	Если (Объект.Ссылка.Пустая()) Тогда
		ВариантПривязкиПриИзмененииНаСервере();
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли; 

	СформироватьЗаголовокФормы();
	ЗагрузитьСеансовуюНастройку();
	
	ЗаполнитьРасчетыПоПроекту();
	ЗаполнитьГрузоперевозкиНаСервере();
	
	УправлениеЭлементамиФормы();
	
	// --- 
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Документ.ПроектыДТ.Изменение" Тогда
		
		ЗаполнитьРасчетыПоПроекту();
		
		Если Параметр.ЕстьИзмененияДляРаспределения И ТаблицаГрузоперевозок.Количество() И Объект.ОсновнойРасчетДТ = Параметр.РасчетСсылка Тогда
			ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаОбработкиОповещения", ЭтаФорма, Новый Структура("Отказ", Ложь));
			ПоказатьВопрос(ПОВ,"В расчет были внесены изменения," + Символы.ПС + "перезаполнить таблицу распределения по грузуперевозкам?", РежимДиалогаВопрос.ДаНет);
		КонецЕсли; 
		
		Если Параметр.ЕстьИзмененияВСумме Тогда
			ЭтаФорма.Модифицированность = Истина;
		КонецЕсли; 
		
	ИначеЕсли ИмяСобытия = "ВыполнитьМетодВладельца" Тогда
				
		Если ТипЗнч(Параметр) = тип("Структура") Тогда
			УникальныйИдентификаторВладельца 	= Неопределено;
			МетодыФормыВладельца 				= Неопределено;
			
			Параметр.Свойство("УникальныйИдентификатор"	, УникальныйИдентификаторВладельца);
			Параметр.Свойство("МетодыФормыВладельца"	, МетодыФормыВладельца);
			
			Если ЭтаФорма.УникальныйИдентификатор = УникальныйИдентификаторВладельца Тогда
				Если Не МетодыФормыВладельца = Неопределено и ТипЗнч(МетодыФормыВладельца) = Тип("Массив") Тогда
					
					Для Каждого СтрокаМассива из МетодыФормыВладельца Цикл
						Попытка
							Выполнить(СтрокаМассива);
						Исключение
						КонецПопытки;
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	

	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаОбработкиОповещения(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Объект.Грузоперевозки.Очистить();
		ТаблицаГрузоперевозок.Очистить();
		ТаблицаРаспределенияТоваров.Очистить();
		ТаблицаРаспределено.Очистить();
		
		ЗаполнитьГрузоперевозкиНаСервере(Истина);
		ЭтаФорма.Модифицированность = Истина;
		
		УправлениеЭлементамиФормы();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Объект.Грузоперевозки.Очистить();
	
	// Перенесем распределенное Количество в объект
	Для каждого СтрокаРаспределения Из ТаблицаРаспределенияТоваров Цикл
		Для каждого СтрокаГрузоперевозка Из ТаблицаГрузоперевозок Цикл
			НоваяСтрока = Объект.Грузоперевозки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРаспределения);
			НоваяСтрока.Грузоперевозка = СтрокаГрузоперевозка.Грузоперевозка;
			НоваяСтрока.Количество     = СтрокаРаспределения[СтрокаГрузоперевозка.ИмяРеквизита];
		КонецЦикла; 
	КонецЦикла; 
		
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	СохранитьСеансовуюНастройку();

КонецПроцедуры

#КонецОбласти

#Область ИнициализацияФормы

&НаСервере
Функция СохранитьСеансовуюНастройку()
	
	_УФС.СохранитьСеансовыеНастройки(ЭтаФорма,,ПФ_НастройкаСписка().СписокКолонок);
	
КонецФункции

&НаСервере
Функция ЗагрузитьСеансовуюНастройку()
	
	Настройка = _УФС.ЗагрузитьСеансовыеНастройки(ЭтаФорма);
	ОбработатьНастройкуСписка(Настройка);
	
КонецФункции

&НаСервере
Функция ПраваДоступаНаСервере()
	// --- 
	
	ПравоРедактирования = CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов");
	Если (НЕ ПравоРедактирования ИЛИ ЭтаФорма.ТолькоПросмотр) Тогда
		
		ЭтаФорма.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
	// --- 
КонецФункции

&НаСервере
Процедура УправлениеЭлементамиФормы()
	
	Элементы.Аналитика.Заголовок = ?(ВариантПривязки = 0, "Заказ","Грузоперевозка");
	Элементы.РасчетыВсегоВал.Заголовок = "Всего платежей ("	+ Объект.Валюта.Наименование + ")";
	Элементы.РасчетыСумма.Заголовок = "Фактурная стоимость (" + Объект.Валюта.Наименование + ")";
	Элементы.РасчетыТаможеннаяСтоимость.Заголовок = "Таможенная стоимость (" + Объект.Валюта.Наименование + ")";
	Элементы.СтраницаГрузоперевозки.Заголовок = ?(Не ТаблицаРаспределенияТоваров.Количество(), "Распределение (*)", "Распределение");
	Элементы.Аналитика.Видимость = Не ВариантПривязки = 2;
	Элементы.СтраницаГрузоперевозки.Видимость = Не ВариантПривязки = 2;
	
КонецПроцедуры

&НаСервере
Функция СформироватьЗаголовокФормы()
	
	ЗаголовокДокумента = 
		"Проект декларации на товары:" 
		+ ?(ЗначениеЗаполнено(Объект.НомерГТД), " " + СокрЛП(Объект.НомерГТД.Код), 
		?(ЗначениеЗаполнено(Объект.Ссылка), " " + СокрЛП(Объект.Номер), " (создание)"))
		+ ?(ЗначениеЗаполнено(Объект.Статус), " (" + Объект.Статус + ")", "");
	ЭтаФорма.Заголовок = ЗаголовокДокумента;
	
КонецФункции

#КонецОбласти

#Область РеквизитыШапки

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.Дата = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантПривязкиПриИзменении(Элемент)
	
	Если ТаблицаРаспределенияТоваров.Количество() Тогда
		ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаУстановкиВарианта", ЭтаФорма, Новый Структура("Отказ", Ложь));
		ПоказатьВопрос(ПОВ,"Таблица распределения по грузоперевозкам будет очищена. Продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ВариантПривязкиПриИзмененииНаСервере();
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли; 
	

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаУстановкиВарианта(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Объект.Грузоперевозки.Очистить();
		ТаблицаГрузоперевозок.Очистить();
		ТаблицаРаспределенияТоваров.Очистить();
		ТаблицаРаспределено.Очистить();
		
		ВариантПривязкиПриИзмененииНаСервере();
		ЭтаФорма.Модифицированность = Истина;
		
		УправлениеЭлементамиФормы();
	Иначе
		Если ЗначениеЗаполнено(Объект.Аналитика) Тогда
			ВариантПривязки = ?(Объект.ПроектПоЗаказу,0,1);
		Иначе
			ВариантПривязки = 2;
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры
  
&НаСервере
Процедура ВариантПривязкиПриИзмененииНаСервере()
	
	
	Если ВариантПривязки = 2 Тогда
		Объект.Аналитика = Неопределено;
		Объект.Грузоперевозки.Очистить();
		ТаблицаГрузоперевозок.Очистить();
		ТаблицаРаспределенияТоваров.Очистить();
		ТаблицаРаспределено.Очистить();
		
	Иначе	
		Объект.ПроектПоЗаказу = ?(ВариантПривязки=0,Истина,Ложь);
		
		// очищаем все ТЧ
		Объект.Грузоперевозки.Очистить();
		
		Если Объект.ПроектПоЗаказу Тогда
			
			Если ТипЗнч(Объект.Аналитика)=Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
				
				Если НЕ Объект.Аналитика.Пустая() Тогда
					
					Объект.Аналитика = Объект.Аналитика.Заказ;
					
				Иначе
					
					Объект.Аналитика = Справочники.CW_Заказы.ПустаяСсылка();
					
				КонецЕсли; 
				
			Иначе
				
				Если ТипЗнч(Объект.Аналитика) <> Тип("СправочникСсылка.CW_Заказы") Тогда
					
					Объект.Аналитика = Справочники.CW_Заказы.ПустаяСсылка();
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		Иначе
			
			Если ТипЗнч(Объект.Аналитика) <> Тип("СправочникСсылка.CW_Грузоперевозки") Тогда
				
				Объект.Аналитика = Справочники.CW_Грузоперевозки.ПустаяСсылка();
				
			КонецЕсли; 
			
		КонецЕсли;
	КонецЕсли;
		
	// изменяем тип
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	УправлениеЭлементамиФормы();
КонецПроцедуры

&НаКлиенте
Процедура НомерГТДПриИзменении(Элемент)
	СформироватьЗаголовокФормы();
КонецПроцедуры

&НаКлиенте
Процедура АналитикаПриИзменении(Элемент)
	
	Если ТаблицаРаспределенияТоваров.Количество() Тогда
		Если Объект.ПроектПоЗаказу Тогда
			ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаИзмененияАналитики", ЭтаФорма, Новый Структура("Отказ", Ложь));
			ПоказатьВопрос(ПОВ,"Документ будет записан. Таблица распределения по грузоперевозкам будет очищена, продолжить", РежимДиалогаВопрос.ДаНет);
		Иначе
			ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаИзмененияАналитики", ЭтаФорма, Новый Структура("Отказ", Ложь));
			ПоказатьВопрос(ПОВ,"Документ будет записан. Таблица распределения по грузоперевозкам будет перезаполнена, продолжить", РежимДиалогаВопрос.ДаНет);
		КонецЕсли; 
	Иначе
		//Если Не Объект.ПроектПоЗаказу Тогда
			ЗаполнитьГрузоперевозкиНаСервере(Истина);
			УправлениеЭлементамиФормы();
			ЭтаФорма.Модифицированность = Истина;
		//КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаИзмененияАналитики(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ЭтаФорма.Записать();
		СформироватьЗаголовокФормы();
		
		Объект.Грузоперевозки.Очистить();
		
		//Если Не Объект.ПроектПоЗаказу Тогда
		ЗаполнитьГрузоперевозкиНаСервере(Истина);
		//Иначе
		//	ТаблицаГрузоперевозок.Очистить();
		//	ТаблицаРаспределенияТоваров.Очистить();
		//	ТаблицаРаспределено.Очистить();
		//КонецЕсли; 
		
		ЭтаФорма.Модифицированность = Истина;
		УправлениеЭлементамиФормы();
		
	КонецЕсли; 
	
КонецПроцедуры
 
#КонецОбласти

#Область Расчеты

&НаКлиенте
Процедура РасчетыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ТекСтрока = Элементы.Расчеты.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		ЗначениеКопирования = Неопределено;
	Иначе
		ЗначениеКопирования = ТекСтрока.Ссылка;
	КонецЕсли; 
	
	
	Если Объект.Ссылка.Пустая() ИЛИ ЭтаФорма.Модифицированность Тогда
		ПОВ = Новый ОписаниеОповещения("ОбработкаОтветаЗаписиПриДобавленииРасчета",Этаформа, Новый Структура("Копирование, ЗначениеКопирования", Копирование, ЗначениеКопирования)); 
		ПоказатьВопрос(ПОВ,"Перед добавлением нового расчета, текущий проект необходимо записать. Записать?", РежимДиалогаВопрос.ДаНет);
	Иначе
		Если Копирование Тогда
			СтруктураПараметров = Новый Структура("Основание, ЗначениеКопирования", Объект.Ссылка, ЗначениеКопирования);
		Иначе
			СтруктураПараметров = Новый Структура("Основание", Объект.Ссылка);
		КонецЕсли; 
		ОткрытьФорму("Справочник.CW_РасчетыДТ.Форма.ФормаЭлемента", СтруктураПараметров,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли; 
			
КонецПроцедуры

&НаКлиенте
Процедура РасчетыПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	ТекСтрока = Элементы.Расчеты.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПОВ_ВопросСохранения = Новый ОписаниеОповещения("ОбработкаВопросаУдалениеРасчета",ЭтаФорма, Новый Структура("РасчетСсылка", ТекСтрока.Ссылка));
	ПоказатьВопрос(ПОВ_ВопросСохранения,"Данный расчет ДТ будет помечен на удаление, продолжить?", РежимДиалогаВопрос.ДаНет);  
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЭтаФорма.Модифицированность Тогда
		ПОВ = Новый ОписаниеОповещения("ОбработкаОтветаЗаписиПриОткрытииРасчета",Этаформа); 
		ПоказатьВопрос(ПОВ,"Перед изменением расчета, текущий проект необходимо записать. Записать?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ИзменитьРасчетОбработка();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРасчет(Команда)
	
	Если ЭтаФорма.Модифицированность Тогда
		ПОВ = Новый ОписаниеОповещения("ОбработкаОтветаЗаписиПриОткрытииРасчета",Этаформа); 
		ПоказатьВопрос(ПОВ,"Перед изменением расчета, текущий проект необходимо записать. Записать?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ИзменитьРасчетОбработка();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРасчетОбработка()
	
	ТекСтрока = Элементы.Расчеты.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено  Тогда
		Возврат;
	КонецЕсли; 
	
	СтруктураПараметров = Новый Структура("Основание, Ключ", Объект.Ссылка, ТекСтрока.Ссылка);
	ОткрытьФорму("Справочник.CW_РасчетыДТ.Форма.ФормаЭлемента", СтруктураПараметров,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры
 
&НаКлиенте
Процедура ОбработкаВопросаУдалениеРасчета(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПометитьРасчетНаУдаление(ДополнительныеПараметры.РасчетСсылка);
		ЗаполнитьРасчетыПоПроекту();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаЗаписиПриДобавленииРасчета(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ЭтаФорма.Записать();
		СформироватьЗаголовокФормы();
		
		Если НЕ ДополнительныеПараметры.Копирование Тогда
			СтруктураПараметров = Новый Структура("Основание", Объект.Ссылка);
		Иначе
			СтруктураПараметров = Новый Структура("Основание, ЗначениеКопирования", Объект.Ссылка, ДополнительныеПараметры.ЗначениеКопирования);
		КонецЕсли; 
		ОткрытьФорму("Справочник.CW_РасчетыДТ.Форма.ФормаЭлемента", СтруктураПараметров,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	Иначе
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаЗаписиПриОткрытииРасчета(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЭтаФорма.Записать();
		ИзменитьРасчетОбработка();
	Иначе
		Возврат;
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасчетыПоПроекту()
	
	Расчеты.Очистить();
	ТаблицаРасчетов = Документы.CW_ПроектыДТ.ПолучитьТаблицуРасчетовПоПроектуДТ(Объект.Ссылка);
	
	НомерСтроки = 1;
	
	Для каждого Стр Из ТаблицаРасчетов Цикл
		
		НоваяСтрока = Расчеты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
		НоваяСтрока.НомерСтроки = НомерСтроки;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла; 
	
	Если Расчеты.Количество() = 1 Тогда
		Если НЕ Расчеты[0].Ссылка = Объект.ОсновнойРасчетДТ Тогда
			Объект.ОсновнойРасчетДТ = Расчеты[0].Ссылка;
			ЭтаФорма.Модифицированность = Истина;
			СформироватьЗаголовокФормы();
		КонецЕсли; 
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.ОсновнойРасчетДТ) Тогда
		Если Не Объект.Статус = Объект.ОсновнойРасчетДТ.Статус Тогда
			Объект.Статус = Объект.ОсновнойРасчетДТ.Статус;
			ЭтаФорма.Модифицированность = Истина;
			СформироватьЗаголовокФормы();
		КонецЕсли; 
	КонецЕсли; 
	
	УправлениеЭлементамиФормы();
	ИтогоСтрокРасчеты = Расчеты.Количество();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПометитьРасчетНаУдаление(РасчетСсылка)
	
	РасчетОбъект = РасчетСсылка.ПолучитьОбъект();
	РасчетОбъект.ПометкаУдаления = Истина;
	
	РасчетОбъект.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область Грузоперевозки

&НаСервере
Процедура ЗаполнитьГрузоперевозкиНаСервере(РаспределитьКоличество = Ложь)
	
	ТаблицаГрузоперевозок.Очистить();
	ТаблицаРаспределенияТоваров.Очистить();
	ТаблицаРаспределено.Очистить();
	
	Если Не ВариантПривязки = 2 Тогда
		ЗаполнитьТаблицуГрузоперевозок();
		СформироватьКолонкиТаблицыГрузоперевозок();
		ЗаполнитьТаблицуРаспределенияТоваров(РаспределитьКоличество);
	КонецЕсли; 
	
	ИтогоСтрокГрузоперевозки = ТаблицаРаспределенияТоваров.Количество();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуГрузоперевозок()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПроектПоЗаказу", Объект.ПроектПоЗаказу);
	Запрос.УстановитьПараметр("Аналитика", Объект.Аналитика);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	CW_Грузоперевозки.Ссылка
	|ИЗ
	|	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	|ГДЕ
	|	CW_Грузоперевозки.ПометкаУдаления = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА &ПроектПоЗаказу
	|				ТОГДА CW_Грузоперевозки.Заказ = &Аналитика
	|			ИНАЧЕ CW_Грузоперевозки.Ссылка = &Аналитика
	|		КОНЕЦ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Сч = 1;
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТаблицаГрузоперевозок.Добавить();
		НоваяСтрока.Грузоперевозка = Выборка.Ссылка;
		НоваяСтрока.ИмяРеквизита   = "Грузоперевозка_" + Сч;
		НоваяСтрока.Заголовок      = СокрЛП(Выборка.Ссылка.CW_Представление);
		
		Сч = Сч + 1;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура СформироватьКолонкиТаблицыГрузоперевозок()
	
	МассивДобавляемыхРеквизитов = Новый Массив;
	МассивУдаляемыхРеквизитов   = Новый Массив;
	МассивУдаляемыхЭлементов    = Новый Массив;
	
	ЭлементыФормыКДобавлению = Новый ТаблицаЗначений;
	ЭлементыФормыКДобавлению.Колонки.Добавить("ИмяРеквизита");
	ЭлементыФормыКДобавлению.Колонки.Добавить("Заголовок");
	
	Массив = Новый Массив;
	Массив.Добавить(Тип("Число"));
	ТипЗначения = Новый ОписаниеТипов(Массив,,,Новый КвалификаторыЧисла(10,3));

	Для каждого Стр Из СформированныеРеквизитыФормы Цикл
		Путь        = Элементы.ТаблицаРаспределенияТоваров.ПутьКДанным + "." + Стр.Значение;
		ИмяЭлемента = Элементы.ТаблицаРаспределенияТоваров.ПутьКДанным + Стр.Значение;
		МассивУдаляемыхРеквизитов.Добавить(Путь);
		МассивУдаляемыхЭлементов.Добавить(ИмяЭлемента); 
	КонецЦикла;  
	
	СформированныеРеквизитыФормы.Очистить();
			
	// Добавляем необходимые реквизиты формы
	Для каждого Стр Из ТаблицаГрузоперевозок Цикл
		
		НовыйРеквизитФормы = Новый РеквизитФормы(Стр.ИмяРеквизита, ТипЗначения, Элементы.ТаблицаРаспределенияТоваров.ПутьКДанным);
		МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизитФормы);
			
		СформированныеРеквизитыФормы.Добавить(Стр.ИмяРеквизита);

		НоваяСтрока = ЭлементыФормыКДобавлению.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Стр);

	КонецЦикла; 
	  		
	ЭтаФорма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов, МассивУдаляемыхРеквизитов);
	
	// Удаляем не используемые элементы формы
	Для каждого Элемент Из МассивУдаляемыхЭлементов Цикл
		Элементы.Удалить(Элементы.Найти(Элемент));
	КонецЦикла; 
	
	// Добавляем необходимые элементы формы
	Для Каждого Стр Из ЭлементыФормыКДобавлению Цикл
		
		ПолноеИмяРеквизита = "" + Элементы.ТаблицаРаспределенияТоваров.ПутьКДанным + Стр.ИмяРеквизита;
		
		ПолеКолонки = Элементы.Добавить(ПолноеИмяРеквизита, Тип("ПолеФормы"), Элементы.ТаблицаРаспределенияТоваров); 
		ПолеКолонки.ПутьКДанным = Элементы.ТаблицаРаспределенияТоваров.ПутьКДанным+"."+Стр.ИмяРеквизита;	
		ПолеКолонки.РастягиватьПоГоризонтали = Ложь;
		ПолеКолонки.ЦветФонаЗаголовка = ЦветаСтиля.РамкаСеткиТаблицы;
		ПолеКолонки.Видимость         = Истина;
		ПолеКолонки.АвтоВысотаЯчейки  = Истина;
		ПолеКолонки.Ширина            = 10;
		ПолеКолонки.Заголовок         = Стр.Заголовок;
		ПолеКолонки.Вид               = ВидПоляФормы.ПолеВвода;
		
	КонецЦикла; 
	
	//Элементы.ТаблицаРаспределенияТоваровНомерСтроки.ФиксацияВТаблице      = ФиксацияВТаблице.Лево;
	//Элементы.ТаблицаРаспределенияТоваровКодТНВЭД.ФиксацияВТаблице         = ФиксацияВТаблице.Лево;
	//Элементы.ТаблицаРаспределенияТоваровНоменклатура.ФиксацияВТаблице     = ФиксацияВТаблице.Лево;
	//Элементы.ТаблицаРаспределенияТоваровЕдиницаИзмерения.ФиксацияВТаблице = ФиксацияВТаблице.Лево;
	//Элементы.ТаблицаРаспределенияТоваровКоличество.ФиксацияВТаблице       = ФиксацияВТаблице.Лево;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуРаспределенияТоваров(РаспределитьКоличество = Ложь)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РасчетДТ", Объект.ОсновнойРасчетДТ);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	CW_РасчетыДТТовары.Ссылка КАК РасчетДТ,
	|	CW_РасчетыДТТовары.КодТНВЭД,
	|	CW_РасчетыДТТовары.Номенклатура,
	|	CW_РасчетыДТТовары.ЕдиницаИзмерения,
	|	СУММА(CW_РасчетыДТТовары.Количество) КАК КоличествоВсего
	|ИЗ
	|	Справочник.CW_РасчетыДТ.Товары КАК CW_РасчетыДТТовары
	|ГДЕ
	|	CW_РасчетыДТТовары.Ссылка = &РасчетДТ
	|
	|СГРУППИРОВАТЬ ПО
	|	CW_РасчетыДТТовары.КодТНВЭД,
	|	CW_РасчетыДТТовары.ЕдиницаИзмерения,
	|	CW_РасчетыДТТовары.Номенклатура,
	|	CW_РасчетыДТТовары.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НомерСтроки = 1;
	КоличествоГрузоперевозок = ТаблицаГрузоперевозок.Количество();
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрока = ТаблицаРаспределенияТоваров.Добавить();
		НоваяСтрока.НомерСтроки = НомерСтроки;
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		Отбор = Новый Структура("КодТНВЭД, Номенклатура, ЕдиницаИзмерения");
		ЗаполнитьЗначенияСвойств(Отбор, Выборка);
		
		НайденныеСтрокиОбъект = Объект.Грузоперевозки.НайтиСтроки(Отбор);
		Идентификатор = НоваяСтрока.ПолучитьИдентификатор();
		
		// Получеам уже распределенное количество по грузоперевозкам
		Для каждого Строка Из НайденныеСтрокиОбъект Цикл
			
			ИменаКолонок = ТаблицаГрузоперевозок.НайтиСтроки(Новый Структура("Грузоперевозка", Строка.Грузоперевозка));
			
			Если ИменаКолонок.Количество() Тогда
				
				ИмяРеквизита = ИменаКолонок[0].ИмяРеквизита;
				
				НоваяСтрока[ИмяРеквизита] = Строка.Количество;
				
				НоваяСтрокаРаспределено = ТаблицаРаспределено.Добавить();
				НоваяСтрокаРаспределено.ИдентификаторСтроки = Идентификатор;
				НоваяСтрокаРаспределено.ИмяРеквизита        = ИменаКолонок[0].ИмяРеквизита;
				НоваяСтрокаРаспределено.Количество          = Строка.Количество;
				
			КонецЕсли; 
						
		КонецЦикла; 
		
		Если Не НайденныеСтрокиОбъект.Количество() И РаспределитьКоличество Тогда
			
			КоличествоРаспределить     = Выборка.КоличествоВсего;
			КоличествоПоГрузоперевозке = Окр(КоличествоРаспределить / КоличествоГрузоперевозок,3);
			
			Для каждого Строка Из ТаблицаГрузоперевозок Цикл
				
				НоваяСтрока[Строка.ИмяРеквизита] = КоличествоПоГрузоперевозке;
				КоличествоРаспределить = КоличествоРаспределить - КоличествоПоГрузоперевозке;
				
				НоваяСтрокаРаспределено = ТаблицаРаспределено.Добавить();
				НоваяСтрокаРаспределено.ИдентификаторСтроки = НоваяСтрока.ПолучитьИдентификатор();
				НоваяСтрокаРаспределено.ИмяРеквизита        = Строка.ИмяРеквизита;
				НоваяСтрокаРаспределено.Количество          = КоличествоПоГрузоперевозке;
				
			КонецЦикла; 
			
			Если Не КоличествоРаспределить = 0 Тогда // Добавим не распределенный остаток в первую строку
				НоваяСтрока[ТаблицаГрузоперевозок[0].ИмяРеквизита] = НоваяСтрока[ТаблицаГрузоперевозок[0].ИмяРеквизита] + КоличествоРаспределить;
				ТаблицаРаспределено[0].Количество = ТаблицаРаспределено[0].Количество + КоличествоРаспределить;
			КонецЕсли;
			
		КонецЕсли; 
		
		
		// Если грузоперевозка всего одна, то распределим все количество на нее
		//Если ТаблицаГрузоперевозок.Количество() = 1 И НайденныеСтрокиОбъект.Количество() = 0 Тогда
		//	
		//	ИмяРеквизита = ТаблицаГрузоперевозок[0].ИмяРеквизита;
		//	
		//	НоваяСтрока[ИмяРеквизита] = Выборка.КоличествоВсего;
		//	
		//	НоваяСтрокаРаспределено = ТаблицаРаспределено.Добавить();
		//	НоваяСтрокаРаспределено.ИдентификаторСтроки = Идентификатор;
		//	НоваяСтрокаРаспределено.ИмяРеквизита        = ИмяРеквизита;
		//	НоваяСтрокаРаспределено.Количество          = Выборка.КоличествоВсего;
		//КонецЕсли; 
								
		НомерСтроки = НомерСтроки  + 1;
		
	КонецЦикла; 
 		
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРаспределенияТоваровПриИзменении(Элемент)
	
	Идентификатор = Элементы.ТаблицаРаспределенияТоваров.ТекущаяСтрока;
	ТекСтрока     = Элементы.ТаблицаРаспределенияТоваров.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ВсегоДоступно = ТекСтрока.КоличествоВсего;
	ИмяКолонки = СтрЗаменить(Элемент.ТекущийЭлемент.Имя, Элементы.ТаблицаРаспределенияТоваров.Имя, "");
	
	// Запоминаем, вводимые пользователем, значения
	Отбор = Новый Структура("ИдентификаторСтроки,ИмяРеквизита");
	Отбор.ИдентификаторСтроки = Идентификатор;
	Отбор.ИмяРеквизита        = ИмяКолонки;
	
	НайденныеСтроки = ТаблицаРаспределено.НайтиСтроки(Отбор);
	КоличествоДоИзм = 0;
	Если НайденныеСтроки.Количество() = 0 Тогда
		СтрокаОтбора = ТаблицаРаспределено.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаОтбора, Отбор);
		СтрокаОтбора.Количество = ТекСтрока[ИмяКолонки];
	Иначе
		СтрокаОтбора = НайденныеСтроки[0]; 
		ЗаполнитьЗначенияСвойств(СтрокаОтбора, Отбор);
		КоличествоДоИзм = СтрокаОтбора.Количество; 
		СтрокаОтбора.Количество = ТекСтрока[ИмяКолонки];
	КонецЕсли; 
	
	Отбор = Новый Структура("ИдентификаторСтроки",Идентификатор);
	МассивВсего = ТаблицаРаспределено.НайтиСтроки(Отбор);
	
	// Проверяем не превышает ли введенное количество доступное количество
	ВсегоПодобрано = 0;
	Для каждого Стр Из МассивВсего Цикл
		ВсегоПодобрано = ВсегоПодобрано + Стр.Количество
	КонецЦикла; 
	
	Если ВсегоПодобрано > ВсегоДоступно Тогда
		
		ПоказатьПредупреждение(,"Количество превышает доступное!", 2);
		
		// Возвращаем значения до изменения
		ВсегоПодобрано = ВсегоПодобрано - ТекСтрока[ИмяКолонки] + КоличествоДоИзм;
		
		ТекСтрока[ИмяКолонки]   = КоличествоДоИзм;
		СтрокаОтбора.Количество = КоличествоДоИзм;
		
	КонецЕсли; 
	
	ОсталосьРаспределить = ВсегоДоступно - ВсегоПодобрано;
	
	Если ОсталосьРаспределить = 0 Тогда
		ИнфоОсталосьРаспределить = "Все количество распределено";
	Иначе
		ИнфоОсталосьРаспределить = "Осталось распределить: " + ОсталосьРаспределить + " " + ТекСтрока.ЕдиницаИзмерения;
	КонецЕсли; 
	
	ЭтаФорма.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРаспределенияТоваровПриАктивизацииСтроки(Элемент)
	
	Идентификатор = Элементы.ТаблицаРаспределенияТоваров.ТекущаяСтрока;
	ТекСтрока     = Элементы.ТаблицаРаспределенияТоваров.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ВсегоДоступно = ТекСтрока.КоличествоВсего;
	
	Отбор = Новый Структура("ИдентификаторСтроки",Идентификатор);
	НайденныеСтрокиВсего = ТаблицаРаспределено.НайтиСтроки(Отбор);
	
	// Проверяем не превышает ли значение доступное количество
	ВсегоПодобрано = 0;
	Для каждого Стр Из НайденныеСтрокиВсего Цикл
		ВсегоПодобрано = ВсегоПодобрано + Стр.Количество
	КонецЦикла; 
	
	ОсталосьРаспределить = ВсегоДоступно - ВсегоПодобрано;
	Если ОсталосьРаспределить = 0 Тогда
		ИнфоОсталосьРаспределить = "Все количество распределено";
	Иначе
		ИнфоОсталосьРаспределить = "Осталось распределить: " + ОсталосьРаспределить + " " + ТекСтрока.ЕдиницаИзмерения;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРаспределенияТоваровПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРаспределенияТоваровПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура НастройкаСписка(Команда)
	
	ПОВ = Новый ОписаниеОповещения("ОбработкаИзмененияНастройкиСпискаРасчетов", ЭтаФорма); 
	ОткрытьФорму("ОбщаяФорма.CW_ФормаНастройкиСписка",ПФ_НастройкаСписка(),,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаИзмененияНастройкиСпискаРасчетов(Ответ, ДополнительныеПараметры) Экспорт
	// --- 
	
	Если (Ответ <> Неопределено) Тогда
		ОбработатьНастройкуСписка(Ответ); 
	КонецЕсли;
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура СделатьОсновным(Команда)
	
	ТекСтрока = Элементы.Расчеты.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	Если Не ТекСтрока.Ссылка = Объект.ОсновнойРасчетДТ Тогда
		ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаУстановкиОсновногоРасчета",ЭтаФорма, Новый Структура("РасчетСсылка", ТекСтрока.Ссылка));
		Если ТаблицаГрузоперевозок.Количество() Тогда
			ТекстВопроса = "Таблица грузоперевозок будет очищена. Сделать данный расчет основным?"
		Иначе
			ТекстВопроса = "Сделать данный расчет основным?";
		КонецЕсли; 
		ПоказатьВопрос(ПОВ,ТекстВопроса,РежимДиалогаВопрос.ДаНет);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаУстановкиОсновногоРасчета(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Объект.Грузоперевозки.Очистить();
		Объект.ОсновнойРасчетДТ = ДополнительныеПараметры.РасчетСсылка;
		Объект.Статус           = ПолучитьСтатусРасчетаСервер(ДополнительныеПараметры.РасчетСсылка); 
		ТаблицаГрузоперевозок.Очистить();
		ТаблицаРаспределенияТоваров.Очистить();
		ТаблицаРаспределено.Очистить();
				
		ЭтаФорма.Модифицированность = Истина;
		
		УправлениеЭлементамиФормы();
		СформироватьЗаголовокФормы();
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтатусРасчетаСервер(РасчетСсылка)
	
	Возврат РасчетСсылка.Статус;
	
КонецФункции
 
&НаКлиенте
Процедура ОбновитьРасчеты(Команда)
	
	ЗаполнитьРасчетыПоПроекту();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГрузоперевозки(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Аналитика) Тогда
		ПоказатьПредупреждение(,"Не указана аналитика!",5);
		Возврат;
	КонецЕсли; 
	
	Если ТаблицаРаспределенияТоваров.Количество() Тогда
		ПОВ = Новый ОписаниеОповещения("ОбработатьВопросЗаполненияГрузоперевозок", ЭтаФорма);
		ПоказатьВопрос(ПОВ, "Табличная часть будет перезаполнена, продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьГрузоперевозкиНаСервере(Истина);
		УправлениеЭлементамиФормы();
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли; 
	
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВопросЗаполненияГрузоперевозок(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.Грузоперевозки.Очистить();
		ЗаполнитьГрузоперевозкиНаСервере(Истина);
		ЭтаФорма.Модифицированность = Истина;
		УправлениеЭлементамиФормы();
	КонецЕсли; 
	
КонецПроцедуры
 
&НаКлиенте
Процедура ОчиститьГрузоперевозки(Команда)
	
	Если ТаблицаРаспределенияТоваров.Количество() Тогда
		ПОВ = Новый ОписаниеОповещения("ОбработатьВопросОчисткиТаблицыГрузоперевозок", ЭтаФорма);
		ПоказатьВопрос(ПОВ, "Табличная часть будет очищена, продолжить?", РежимДиалогаВопрос.ДаНет);
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВопросОчисткиТаблицыГрузоперевозок(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		Объект.Грузоперевозки.Очистить();
		ТаблицаГрузоперевозок.Очистить();
		ТаблицаРаспределенияТоваров.Очистить();
		ТаблицаРаспределено.Очистить();
		ЭтаФорма.Модифицированность = Истина;
		УправлениеЭлементамиФормы();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьГрузоперевозки(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Аналитика) Тогда
		ПоказатьПредупреждение(,"Не указана аналитика!",5);
		Возврат;
	КонецЕсли; 

	Если ЭтаФорма.Модифицированность Тогда
		ПОВ = Новый ОписаниеОповещения("ОбработатьВопросОбновленияТаблицыГрузоперевозок", ЭтаФорма);
		ПоказатьВопрос(ПОВ, "Перед обновлением данных документ будет записан, продолжить?", РежимДиалогаВопрос.ДаНет);
	Иначе
		ЗаполнитьГрузоперевозкиНаСервере();
		УправлениеЭлементамиФормы();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВопросОбновленияТаблицыГрузоперевозок(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЭтаФорма.Записать();
		СформироватьЗаголовокФормы();
		ЗаполнитьГрузоперевозкиНаСервере();
		УправлениеЭлементамиФормы();
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область НастройкаСпискаРасчетов

&НаСервере
Функция ПФ_НастройкаСписка()
	
	ПФ = Новый Структура("Источник,СписокКолонок",ЭтаФорма.Заголовок,Новый Массив);
	
	СформироватьСтруктуруКолонок(Элементы.Расчеты, ПФ.СписокКолонок);
	СписокКолонок.ЗагрузитьЗначения(ПФ.СписокКолонок);
	
	Возврат(ПФ);
	
КонецФункции

&НаСервере
Процедура СформироватьСтруктуруКолонок(Элемент,МассивСК)
	
	// обходим подчинённые элементы
	Для каждого ПЭ Из Элемент.ПодчиненныеЭлементы Цикл
		
		Узел = ШаблонУзла();
		_сф.ст_ЗаполнитьСвойства(Узел,"Имя,Заголовок,Видимость",ПЭ);
		Узел.ЭтоГруппа = (ТипЗнч(ПЭ) <> Тип("ПолеФормы"));
		МассивСК.Добавить(Узел);
		// --- 
		Если Узел.ЭтоГруппа Тогда
			
			СформироватьСтруктуруКолонок(ПЭ,Узел.Элементы);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Функция ШаблонУзла()
	
	Возврат(Новый Структура("Имя,Заголовок,Видимость,ИзменениеВидимости,ЭтоГруппа,Элементы","","",Ложь,Истина,Ложь,Новый Массив));
	
КонецФункции

&НаСервере
Процедура ОбработатьНастройкуСписка(Настройка)
	
	Если (Настройка = Неопределено) Тогда
		
		Возврат;
		
	КонецЕсли; 
	
	Попытка
		
		// необходимо проверить порядок и видимость, 
		// сначала видимость
		Для каждого СК Из Настройка Цикл
			
			ОбновитьВидимость(СК);
			
		КонецЦикла; 
		// потом порядок
		Если (СписокКолонок.Количество()=0) Тогда
			СформироватьСтруктуруКолонок(Элементы.Расчеты,СписокКолонок);
			ОбновитьПорядок(Настройка);
		Иначе
			ОбновитьПорядок(Настройка);
		КонецЕсли; 
		
	Исключение
		//ОписаниеОшибки()
	КонецПопытки; 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимость(СК)
	
	ЭлементФормы = Элементы.Найти(СК.Имя);
	Если ЭлементФормы <> Неопределено Тогда
		
		ЭлементФормы.Видимость = СК.Видимость;
		Если СК.Видимость И СК.ЭтоГруппа Тогда
			
			Для каждого Элемент Из СК.Элементы Цикл
				
				ОбновитьВидимость(Элемент);
				
			КонецЦикла; 
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПорядок(Настройка)
	
	ТекущийИндекс = 1;
	Для каждого СК Из Настройка Цикл
		
		ПередвигаемыйЭлемент = Элементы[СК.Имя];
		Элементы.Переместить(ПередвигаемыйЭлемент, ПередвигаемыйЭлемент.Родитель);
		
		Если СК.ЭтоГруппа Тогда
			
			ОбновитьПорядок(СК.Элементы);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	СписокКолонок.ЗагрузитьЗначения(Настройка);
КонецПроцедуры


#КонецОбласти

#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	//Подсистема.РаботаСПодключаемымиОбъектами
	CW_ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	//Подсистема.РаботаСПодключаемымиОбъектами
	
КонецПроцедуры
